SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_modem.h
/* Bit fields for MODEM CHFCOE01 */
#define _MODEM_CHFCOE01_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_CHFCOE01            */
#define _MODEM_CHFCOE01_MASK                                    0x003FFFFFUL                               /**< Mask for MODEM_CHFCOE01                     */
#define _MODEM_CHFCOE01_SET0COEFF3_SHIFT                        0                                          /**< Shift value for MODEM_SET0COEFF3            */
#define _MODEM_CHFCOE01_SET0COEFF3_MASK                         0x7FFUL                                    /**< Bit mask for MODEM_SET0COEFF3               */
#define _MODEM_CHFCOE01_SET0COEFF3_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE01             */
#define MODEM_CHFCOE01_SET0COEFF3_DEFAULT                       (_MODEM_CHFCOE01_SET0COEFF3_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE01     */
#define _MODEM_CHFCOE01_SET0COEFF4_SHIFT                        11                                         /**< Shift value for MODEM_SET0COEFF4            */
#define _MODEM_CHFCOE01_SET0COEFF4_MASK                         0x3FF800UL                                 /**< Bit mask for MODEM_SET0COEFF4               */
#define _MODEM_CHFCOE01_SET0COEFF4_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE01             */
#define MODEM_CHFCOE01_SET0COEFF4_DEFAULT                       (_MODEM_CHFCOE01_SET0COEFF4_DEFAULT << 11) /**< Shifted mode DEFAULT for MODEM_CHFCOE01     */

/* Bit fields for MODEM CHFCOE02 */
#define _MODEM_CHFCOE02_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_CHFCOE02            */
#define _MODEM_CHFCOE02_MASK                                    0x007FFFFFUL                               /**< Mask for MODEM_CHFCOE02                     */
#define _MODEM_CHFCOE02_SET0COEFF5_SHIFT                        0                                          /**< Shift value for MODEM_SET0COEFF5            */
#define _MODEM_CHFCOE02_SET0COEFF5_MASK                         0x7FFUL                                    /**< Bit mask for MODEM_SET0COEFF5               */
#define _MODEM_CHFCOE02_SET0COEFF5_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE02             */
#define MODEM_CHFCOE02_SET0COEFF5_DEFAULT                       (_MODEM_CHFCOE02_SET0COEFF5_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE02     */
#define _MODEM_CHFCOE02_SET0COEFF6_SHIFT                        11                                         /**< Shift value for MODEM_SET0COEFF6            */
#define _MODEM_CHFCOE02_SET0COEFF6_MASK                         0x7FF800UL                                 /**< Bit mask for MODEM_SET0COEFF6               */
#define _MODEM_CHFCOE02_SET0COEFF6_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE02             */
#define MODEM_CHFCOE02_SET0COEFF6_DEFAULT                       (_MODEM_CHFCOE02_SET0COEFF6_DEFAULT << 11) /**< Shifted mode DEFAULT for MODEM_CHFCOE02     */

/* Bit fields for MODEM CHFCOE03 */
#define _MODEM_CHFCOE03_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_CHFCOE03            */
#define _MODEM_CHFCOE03_MASK                                    0x00FFFFFFUL                               /**< Mask for MODEM_CHFCOE03                     */
#define _MODEM_CHFCOE03_SET0COEFF7_SHIFT                        0                                          /**< Shift value for MODEM_SET0COEFF7            */
#define _MODEM_CHFCOE03_SET0COEFF7_MASK                         0xFFFUL                                    /**< Bit mask for MODEM_SET0COEFF7               */
#define _MODEM_CHFCOE03_SET0COEFF7_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE03             */
#define MODEM_CHFCOE03_SET0COEFF7_DEFAULT                       (_MODEM_CHFCOE03_SET0COEFF7_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE03     */
#define _MODEM_CHFCOE03_SET0COEFF8_SHIFT                        12                                         /**< Shift value for MODEM_SET0COEFF8            */
#define _MODEM_CHFCOE03_SET0COEFF8_MASK                         0xFFF000UL                                 /**< Bit mask for MODEM_SET0COEFF8               */
#define _MODEM_CHFCOE03_SET0COEFF8_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE03             */
#define MODEM_CHFCOE03_SET0COEFF8_DEFAULT                       (_MODEM_CHFCOE03_SET0COEFF8_DEFAULT << 12) /**< Shifted mode DEFAULT for MODEM_CHFCOE03     */

/* Bit fields for MODEM CHFCOE04 */
#define _MODEM_CHFCOE04_RESETVALUE                              0x00000000UL                                /**< Default value for MODEM_CHFCOE04            */
#define _MODEM_CHFCOE04_MASK                                    0x0FFFFFFFUL                                /**< Mask for MODEM_CHFCOE04                     */
#define _MODEM_CHFCOE04_SET0COEFF9_SHIFT                        0                                           /**< Shift value for MODEM_SET0COEFF9            */
#define _MODEM_CHFCOE04_SET0COEFF9_MASK                         0x3FFFUL                                    /**< Bit mask for MODEM_SET0COEFF9               */
#define _MODEM_CHFCOE04_SET0COEFF9_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE04             */
#define MODEM_CHFCOE04_SET0COEFF9_DEFAULT                       (_MODEM_CHFCOE04_SET0COEFF9_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_CHFCOE04     */
#define _MODEM_CHFCOE04_SET0COEFF10_SHIFT                       14                                          /**< Shift value for MODEM_SET0COEFF10           */
#define _MODEM_CHFCOE04_SET0COEFF10_MASK                        0xFFFC000UL                                 /**< Bit mask for MODEM_SET0COEFF10              */
#define _MODEM_CHFCOE04_SET0COEFF10_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE04             */
#define MODEM_CHFCOE04_SET0COEFF10_DEFAULT                      (_MODEM_CHFCOE04_SET0COEFF10_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_CHFCOE04     */

/* Bit fields for MODEM CHFCOE05 */
#define _MODEM_CHFCOE05_RESETVALUE                              0x00000000UL                                /**< Default value for MODEM_CHFCOE05            */
#define _MODEM_CHFCOE05_MASK                                    0x3FFFFFFFUL                                /**< Mask for MODEM_CHFCOE05                     */
#define _MODEM_CHFCOE05_SET0COEFF11_SHIFT                       0                                           /**< Shift value for MODEM_SET0COEFF11           */
#define _MODEM_CHFCOE05_SET0COEFF11_MASK                        0x3FFFUL                                    /**< Bit mask for MODEM_SET0COEFF11              */
#define _MODEM_CHFCOE05_SET0COEFF11_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE05             */
#define MODEM_CHFCOE05_SET0COEFF11_DEFAULT                      (_MODEM_CHFCOE05_SET0COEFF11_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE05     */
#define _MODEM_CHFCOE05_SET0COEFF12_SHIFT                       14                                          /**< Shift value for MODEM_SET0COEFF12           */
#define _MODEM_CHFCOE05_SET0COEFF12_MASK                        0x3FFFC000UL                                /**< Bit mask for MODEM_SET0COEFF12              */
#define _MODEM_CHFCOE05_SET0COEFF12_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE05             */
#define MODEM_CHFCOE05_SET0COEFF12_DEFAULT                      (_MODEM_CHFCOE05_SET0COEFF12_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_CHFCOE05     */

/* Bit fields for MODEM CHFCOE06 */
#define _MODEM_CHFCOE06_RESETVALUE                              0x00000000UL                                /**< Default value for MODEM_CHFCOE06            */
#define _MODEM_CHFCOE06_MASK                                    0xFFFFFFFFUL                                /**< Mask for MODEM_CHFCOE06                     */
#define _MODEM_CHFCOE06_SET0COEFF13_SHIFT                       0                                           /**< Shift value for MODEM_SET0COEFF13           */
#define _MODEM_CHFCOE06_SET0COEFF13_MASK                        0xFFFFUL                                    /**< Bit mask for MODEM_SET0COEFF13              */
#define _MODEM_CHFCOE06_SET0COEFF13_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE06             */
#define MODEM_CHFCOE06_SET0COEFF13_DEFAULT                      (_MODEM_CHFCOE06_SET0COEFF13_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE06     */
#define _MODEM_CHFCOE06_SET0COEFF14_SHIFT                       16                                          /**< Shift value for MODEM_SET0COEFF14           */
#define _MODEM_CHFCOE06_SET0COEFF14_MASK                        0xFFFF0000UL                                /**< Bit mask for MODEM_SET0COEFF14              */
#define _MODEM_CHFCOE06_SET0COEFF14_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_CHFCOE06             */
#define MODEM_CHFCOE06_SET0COEFF14_DEFAULT                      (_MODEM_CHFCOE06_SET0COEFF14_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_CHFCOE06     */

/* Bit fields for MODEM CHFCOE10 */
#define _MODEM_CHFCOE10_RESETVALUE                              0x00000000UL                               /**< Default value for MODEM_CHFCOE10            */
#define _MODEM_CHFCOE10_MASK                                    0x3FFFFFFFUL                               /**< Mask for MODEM_CHFCOE10                     */
#define _MODEM_CHFCOE10_SET1COEFF0_SHIFT                        0                                          /**< Shift value for MODEM_SET1COEFF0            */
#define _MODEM_CHFCOE10_SET1COEFF0_MASK                         0x3FFUL                                    /**< Bit mask for MODEM_SET1COEFF0               */
#define _MODEM_CHFCOE10_SET1COEFF0_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE10             */
#define MODEM_CHFCOE10_SET1COEFF0_DEFAULT                       (_MODEM_CHFCOE10_SET1COEFF0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_CHFCOE10     */
#define _MODEM_CHFCOE10_SET1COEFF1_SHIFT                        10                                         /**< Shift value for MODEM_SET1COEFF1            */
#define _MODEM_CHFCOE10_SET1COEFF1_MASK                         0xFFC00UL                                  /**< Bit mask for MODEM_SET1COEFF1               */
#define _MODEM_CHFCOE10_SET1COEFF1_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE10             */
#define MODEM_CHFCOE10_SET1COEFF1_DEFAULT                       (_MODEM_CHFCOE10_SET1COEFF1_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_CHFCOE10     */
#define _MODEM_CHFCOE10_SET1COEFF2_SHIFT                        20                                         /**< Shift value for MODEM_SET1COEFF2            */
#define _MODEM_CHFCOE10_SET1COEFF2_MASK                         0x3FF00000UL                               /**< Bit mask for MODEM_SET1COEFF2               */
#define _MODEM_CHFCOE10_SET1COEFF2_DEFAULT                      0x00000000UL                               /**< Mode DEFAULT for MODEM_CHFCOE10             */
#define MODEM_CHFCOE10_SET1COEFF2_DEFAULT                       (_MODEM_CHFCOE10_SET1COEFF2_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_CHFCOE10     */

