SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_modem.h
/* Bit fields for MODEM RXRESTART */
#define _MODEM_RXRESTART_RESETVALUE                             0x00001860UL                                                 /**< Default value for MODEM_RXRESTART           */
#define _MODEM_RXRESTART_MASK                                   0xC0011FF1UL                                                 /**< Mask for MODEM_RXRESTART                    */
#define MODEM_RXRESTART_RXRESTARTUPONMARSSI                     (0x1UL << 0)                                                 /**< Restart RX upon RSSI MA above threshold     */
#define _MODEM_RXRESTART_RXRESTARTUPONMARSSI_SHIFT              0                                                            /**< Shift value for MODEM_RXRESTARTUPONMARSSI   */
#define _MODEM_RXRESTART_RXRESTARTUPONMARSSI_MASK               0x1UL                                                        /**< Bit mask for MODEM_RXRESTARTUPONMARSSI      */
#define _MODEM_RXRESTART_RXRESTARTUPONMARSSI_DEFAULT            0x00000000UL                                                 /**< Mode DEFAULT for MODEM_RXRESTART            */
#define MODEM_RXRESTART_RXRESTARTUPONMARSSI_DEFAULT             (_MODEM_RXRESTART_RXRESTARTUPONMARSSI_DEFAULT << 0)          /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_SHIFT             4                                                            /**< Shift value for MODEM_RXRESTARTMATHRESHOLD  */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_MASK              0xF0UL                                                       /**< Bit mask for MODEM_RXRESTARTMATHRESHOLD     */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DEFAULT           0x00000006UL                                                 /**< Mode DEFAULT for MODEM_RXRESTART            */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB0               0x00000000UL                                                 /**< Mode DB0 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB1               0x00000001UL                                                 /**< Mode DB1 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB2               0x00000002UL                                                 /**< Mode DB2 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB3               0x00000003UL                                                 /**< Mode DB3 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB4               0x00000004UL                                                 /**< Mode DB4 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB5               0x00000005UL                                                 /**< Mode DB5 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB6               0x00000006UL                                                 /**< Mode DB6 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB7               0x00000007UL                                                 /**< Mode DB7 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB8               0x00000008UL                                                 /**< Mode DB8 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB9               0x00000009UL                                                 /**< Mode DB9 for MODEM_RXRESTART                */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB10              0x0000000AUL                                                 /**< Mode DB10 for MODEM_RXRESTART               */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB11              0x0000000BUL                                                 /**< Mode DB11 for MODEM_RXRESTART               */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB12              0x0000000CUL                                                 /**< Mode DB12 for MODEM_RXRESTART               */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB13              0x0000000DUL                                                 /**< Mode DB13 for MODEM_RXRESTART               */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB14              0x0000000EUL                                                 /**< Mode DB14 for MODEM_RXRESTART               */
#define _MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB15              0x0000000FUL                                                 /**< Mode DB15 for MODEM_RXRESTART               */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DEFAULT            (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DEFAULT << 4)         /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB0                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB0 << 4)             /**< Shifted mode DB0 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB1                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB1 << 4)             /**< Shifted mode DB1 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB2                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB2 << 4)             /**< Shifted mode DB2 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB3                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB3 << 4)             /**< Shifted mode DB3 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB4                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB4 << 4)             /**< Shifted mode DB4 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB5                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB5 << 4)             /**< Shifted mode DB5 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB6                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB6 << 4)             /**< Shifted mode DB6 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB7                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB7 << 4)             /**< Shifted mode DB7 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB8                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB8 << 4)             /**< Shifted mode DB8 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB9                (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB9 << 4)             /**< Shifted mode DB9 for MODEM_RXRESTART        */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB10               (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB10 << 4)            /**< Shifted mode DB10 for MODEM_RXRESTART       */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB11               (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB11 << 4)            /**< Shifted mode DB11 for MODEM_RXRESTART       */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB12               (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB12 << 4)            /**< Shifted mode DB12 for MODEM_RXRESTART       */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB13               (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB13 << 4)            /**< Shifted mode DB13 for MODEM_RXRESTART       */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB14               (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB14 << 4)            /**< Shifted mode DB14 for MODEM_RXRESTART       */
#define MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB15               (_MODEM_RXRESTART_RXRESTARTMATHRESHOLD_DB15 << 4)            /**< Shifted mode DB15 for MODEM_RXRESTART       */
#define _MODEM_RXRESTART_RXRESTARTMALATCHSEL_SHIFT              8                                                            /**< Shift value for MODEM_RXRESTARTMALATCHSEL   */
#define _MODEM_RXRESTART_RXRESTARTMALATCHSEL_MASK               0x300UL                                                      /**< Bit mask for MODEM_RXRESTARTMALATCHSEL      */
#define _MODEM_RXRESTART_RXRESTARTMALATCHSEL_DEFAULT            0x00000000UL                                                 /**< Mode DEFAULT for MODEM_RXRESTART            */
#define _MODEM_RXRESTART_RXRESTARTMALATCHSEL_RE_PRE_DET         0x00000000UL                                                 /**< Mode RE_PRE_DET for MODEM_RXRESTART         */
#define _MODEM_RXRESTART_RXRESTARTMALATCHSEL_RE_SYNC_DET        0x00000001UL                                                 /**< Mode RE_SYNC_DET for MODEM_RXRESTART        */
#define _MODEM_RXRESTART_RXRESTARTMALATCHSEL_EITHER1            0x00000002UL                                                 /**< Mode EITHER1 for MODEM_RXRESTART            */
#define _MODEM_RXRESTART_RXRESTARTMALATCHSEL_EITHER2            0x00000003UL                                                 /**< Mode EITHER2 for MODEM_RXRESTART            */
#define MODEM_RXRESTART_RXRESTARTMALATCHSEL_DEFAULT             (_MODEM_RXRESTART_RXRESTARTMALATCHSEL_DEFAULT << 8)          /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_RXRESTARTMALATCHSEL_RE_PRE_DET          (_MODEM_RXRESTART_RXRESTARTMALATCHSEL_RE_PRE_DET << 8)       /**< Shifted mode RE_PRE_DET for MODEM_RXRESTART */
#define MODEM_RXRESTART_RXRESTARTMALATCHSEL_RE_SYNC_DET         (_MODEM_RXRESTART_RXRESTARTMALATCHSEL_RE_SYNC_DET << 8)      /**< Shifted mode RE_SYNC_DET for MODEM_RXRESTART*/
#define MODEM_RXRESTART_RXRESTARTMALATCHSEL_EITHER1             (_MODEM_RXRESTART_RXRESTARTMALATCHSEL_EITHER1 << 8)          /**< Shifted mode EITHER1 for MODEM_RXRESTART    */
#define MODEM_RXRESTART_RXRESTARTMALATCHSEL_EITHER2             (_MODEM_RXRESTART_RXRESTARTMALATCHSEL_EITHER2 << 8)          /**< Shifted mode EITHER2 for MODEM_RXRESTART    */
#define _MODEM_RXRESTART_RXRESTARTMACOMPENSEL_SHIFT             10                                                           /**< Shift value for MODEM_RXRESTARTMACOMPENSEL  */
#define _MODEM_RXRESTART_RXRESTARTMACOMPENSEL_MASK              0xC00UL                                                      /**< Bit mask for MODEM_RXRESTARTMACOMPENSEL     */
#define _MODEM_RXRESTART_RXRESTARTMACOMPENSEL_DEFAULT           0x00000002UL                                                 /**< Mode DEFAULT for MODEM_RXRESTART            */
#define _MODEM_RXRESTART_RXRESTARTMACOMPENSEL_PRE_DET           0x00000000UL                                                 /**< Mode PRE_DET for MODEM_RXRESTART            */
#define _MODEM_RXRESTART_RXRESTARTMACOMPENSEL_FRAME_SYNC_DET    0x00000001UL                                                 /**< Mode FRAME_SYNC_DET for MODEM_RXRESTART     */
#define _MODEM_RXRESTART_RXRESTARTMACOMPENSEL_BOTH1             0x00000002UL                                                 /**< Mode BOTH1 for MODEM_RXRESTART              */
#define _MODEM_RXRESTART_RXRESTARTMACOMPENSEL_BOTH2             0x00000003UL                                                 /**< Mode BOTH2 for MODEM_RXRESTART              */
#define MODEM_RXRESTART_RXRESTARTMACOMPENSEL_DEFAULT            (_MODEM_RXRESTART_RXRESTARTMACOMPENSEL_DEFAULT << 10)        /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_RXRESTARTMACOMPENSEL_PRE_DET            (_MODEM_RXRESTART_RXRESTARTMACOMPENSEL_PRE_DET << 10)        /**< Shifted mode PRE_DET for MODEM_RXRESTART    */
#define MODEM_RXRESTART_RXRESTARTMACOMPENSEL_FRAME_SYNC_DET     (_MODEM_RXRESTART_RXRESTARTMACOMPENSEL_FRAME_SYNC_DET << 10) /**< Shifted mode FRAME_SYNC_DET for MODEM_RXRESTART*/
#define MODEM_RXRESTART_RXRESTARTMACOMPENSEL_BOTH1              (_MODEM_RXRESTART_RXRESTARTMACOMPENSEL_BOTH1 << 10)          /**< Shifted mode BOTH1 for MODEM_RXRESTART      */
#define MODEM_RXRESTART_RXRESTARTMACOMPENSEL_BOTH2              (_MODEM_RXRESTART_RXRESTARTMACOMPENSEL_BOTH2 << 10)          /**< Shifted mode BOTH2 for MODEM_RXRESTART      */
#define MODEM_RXRESTART_RXRESTARTMATAP                          (0x1UL << 12)                                                /**< Number of taps for the MA filter            */
#define _MODEM_RXRESTART_RXRESTARTMATAP_SHIFT                   12                                                           /**< Shift value for MODEM_RXRESTARTMATAP        */
#define _MODEM_RXRESTART_RXRESTARTMATAP_MASK                    0x1000UL                                                     /**< Bit mask for MODEM_RXRESTARTMATAP           */
#define _MODEM_RXRESTART_RXRESTARTMATAP_DEFAULT                 0x00000001UL                                                 /**< Mode DEFAULT for MODEM_RXRESTART            */
#define _MODEM_RXRESTART_RXRESTARTMATAP_TAPS4                   0x00000000UL                                                 /**< Mode TAPS4 for MODEM_RXRESTART              */
#define _MODEM_RXRESTART_RXRESTARTMATAP_TAPS8                   0x00000001UL                                                 /**< Mode TAPS8 for MODEM_RXRESTART              */
#define MODEM_RXRESTART_RXRESTARTMATAP_DEFAULT                  (_MODEM_RXRESTART_RXRESTARTMATAP_DEFAULT << 12)              /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_RXRESTARTMATAP_TAPS4                    (_MODEM_RXRESTART_RXRESTARTMATAP_TAPS4 << 12)                /**< Shifted mode TAPS4 for MODEM_RXRESTART      */
#define MODEM_RXRESTART_RXRESTARTMATAP_TAPS8                    (_MODEM_RXRESTART_RXRESTARTMATAP_TAPS8 << 12)                /**< Shifted mode TAPS8 for MODEM_RXRESTART      */
#define MODEM_RXRESTART_RXRESTARTB4PREDET                       (0x1UL << 16)                                                /**< whether to restart RX before pre det        */
#define _MODEM_RXRESTART_RXRESTARTB4PREDET_SHIFT                16                                                           /**< Shift value for MODEM_RXRESTARTB4PREDET     */
#define _MODEM_RXRESTART_RXRESTARTB4PREDET_MASK                 0x10000UL                                                    /**< Bit mask for MODEM_RXRESTARTB4PREDET        */
#define _MODEM_RXRESTART_RXRESTARTB4PREDET_DEFAULT              0x00000000UL                                                 /**< Mode DEFAULT for MODEM_RXRESTART            */
#define MODEM_RXRESTART_RXRESTARTB4PREDET_DEFAULT               (_MODEM_RXRESTART_RXRESTARTB4PREDET_DEFAULT << 16)           /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_ANTSWRSTFLTTDIS                         (0x1UL << 30)                                                /**< ANT SW RESET Filter Disable                 */
#define _MODEM_RXRESTART_ANTSWRSTFLTTDIS_SHIFT                  30                                                           /**< Shift value for MODEM_ANTSWRSTFLTTDIS       */
#define _MODEM_RXRESTART_ANTSWRSTFLTTDIS_MASK                   0x40000000UL                                                 /**< Bit mask for MODEM_ANTSWRSTFLTTDIS          */
#define _MODEM_RXRESTART_ANTSWRSTFLTTDIS_DEFAULT                0x00000000UL                                                 /**< Mode DEFAULT for MODEM_RXRESTART            */
#define MODEM_RXRESTART_ANTSWRSTFLTTDIS_DEFAULT                 (_MODEM_RXRESTART_ANTSWRSTFLTTDIS_DEFAULT << 30)             /**< Shifted mode DEFAULT for MODEM_RXRESTART    */
#define MODEM_RXRESTART_FLTRSTEN                                (0x1UL << 31)                                                /**< RX Chain Filter reset enable                */
#define _MODEM_RXRESTART_FLTRSTEN_SHIFT                         31                                                           /**< Shift value for MODEM_FLTRSTEN              */
#define _MODEM_RXRESTART_FLTRSTEN_MASK                          0x80000000UL                                                 /**< Bit mask for MODEM_FLTRSTEN                 */
#define _MODEM_RXRESTART_FLTRSTEN_DEFAULT                       0x00000000UL                                                 /**< Mode DEFAULT for MODEM_RXRESTART            */
#define MODEM_RXRESTART_FLTRSTEN_DEFAULT                        (_MODEM_RXRESTART_FLTRSTEN_DEFAULT << 31)                    /**< Shifted mode DEFAULT for MODEM_RXRESTART    */

/* Bit fields for MODEM SQ */
#define _MODEM_SQ_RESETVALUE                                    0x00000000UL                       /**< Default value for MODEM_SQ                  */
#define _MODEM_SQ_MASK                                          0xFFFF0003UL                       /**< Mask for MODEM_SQ                           */
#define MODEM_SQ_SQEN                                           (0x1UL << 0)                       /**< SQ enable                                   */
#define _MODEM_SQ_SQEN_SHIFT                                    0                                  /**< Shift value for MODEM_SQEN                  */
#define _MODEM_SQ_SQEN_MASK                                     0x1UL                              /**< Bit mask for MODEM_SQEN                     */
#define _MODEM_SQ_SQEN_DEFAULT                                  0x00000000UL                       /**< Mode DEFAULT for MODEM_SQ                   */
#define MODEM_SQ_SQEN_DEFAULT                                   (_MODEM_SQ_SQEN_DEFAULT << 0)      /**< Shifted mode DEFAULT for MODEM_SQ           */
#define MODEM_SQ_SQSWRST                                        (0x1UL << 1)                       /**< SQ hold demod                               */
#define _MODEM_SQ_SQSWRST_SHIFT                                 1                                  /**< Shift value for MODEM_SQSWRST               */
#define _MODEM_SQ_SQSWRST_MASK                                  0x2UL                              /**< Bit mask for MODEM_SQSWRST                  */
#define _MODEM_SQ_SQSWRST_DEFAULT                               0x00000000UL                       /**< Mode DEFAULT for MODEM_SQ                   */
#define MODEM_SQ_SQSWRST_DEFAULT                                (_MODEM_SQ_SQSWRST_DEFAULT << 1)   /**< Shifted mode DEFAULT for MODEM_SQ           */
#define _MODEM_SQ_SQTIMOUT_SHIFT                                16                                 /**< Shift value for MODEM_SQTIMOUT              */
#define _MODEM_SQ_SQTIMOUT_MASK                                 0xFFFF0000UL                       /**< Bit mask for MODEM_SQTIMOUT                 */
#define _MODEM_SQ_SQTIMOUT_DEFAULT                              0x00000000UL                       /**< Mode DEFAULT for MODEM_SQ                   */
#define MODEM_SQ_SQTIMOUT_DEFAULT                               (_MODEM_SQ_SQTIMOUT_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SQ           */

/* Bit fields for MODEM SQEXT */
#define _MODEM_SQEXT_RESETVALUE                                 0x00000000UL                              /**< Default value for MODEM_SQEXT               */
#define _MODEM_SQEXT_MASK                                       0xFFFFFFFFUL                              /**< Mask for MODEM_SQEXT                        */
#define _MODEM_SQEXT_SQSTG2TIMOUT_SHIFT                         0                                         /**< Shift value for MODEM_SQSTG2TIMOUT          */
#define _MODEM_SQEXT_SQSTG2TIMOUT_MASK                          0xFFFFUL                                  /**< Bit mask for MODEM_SQSTG2TIMOUT             */
#define _MODEM_SQEXT_SQSTG2TIMOUT_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for MODEM_SQEXT                */
#define MODEM_SQEXT_SQSTG2TIMOUT_DEFAULT                        (_MODEM_SQEXT_SQSTG2TIMOUT_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SQEXT        */
#define _MODEM_SQEXT_SQSTG3TIMOUT_SHIFT                         16                                        /**< Shift value for MODEM_SQSTG3TIMOUT          */
#define _MODEM_SQEXT_SQSTG3TIMOUT_MASK                          0xFFFF0000UL                              /**< Bit mask for MODEM_SQSTG3TIMOUT             */
#define _MODEM_SQEXT_SQSTG3TIMOUT_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for MODEM_SQEXT                */
#define MODEM_SQEXT_SQSTG3TIMOUT_DEFAULT                        (_MODEM_SQEXT_SQSTG3TIMOUT_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SQEXT        */

/* Bit fields for MODEM SQI */
#define _MODEM_SQI_RESETVALUE                                   0x00000000UL                         /**< Default value for MODEM_SQI                 */
#define _MODEM_SQI_MASK                                         0x00FF0001UL                         /**< Mask for MODEM_SQI                          */
#define MODEM_SQI_SQISELECT                                     (0x1UL << 0)                         /**< SQI selection bit                           */
#define _MODEM_SQI_SQISELECT_SHIFT                              0                                    /**< Shift value for MODEM_SQISELECT             */
#define _MODEM_SQI_SQISELECT_MASK                               0x1UL                                /**< Bit mask for MODEM_SQISELECT                */
#define _MODEM_SQI_SQISELECT_DEFAULT                            0x00000000UL                         /**< Mode DEFAULT for MODEM_SQI                  */
#define _MODEM_SQI_SQISELECT_CORR                               0x00000000UL                         /**< Mode CORR for MODEM_SQI                     */
#define _MODEM_SQI_SQISELECT_ERROR                              0x00000001UL                         /**< Mode ERROR for MODEM_SQI                    */
#define MODEM_SQI_SQISELECT_DEFAULT                             (_MODEM_SQI_SQISELECT_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_SQI          */
#define MODEM_SQI_SQISELECT_CORR                                (_MODEM_SQI_SQISELECT_CORR << 0)     /**< Shifted mode CORR for MODEM_SQI             */
#define MODEM_SQI_SQISELECT_ERROR                               (_MODEM_SQI_SQISELECT_ERROR << 0)    /**< Shifted mode ERROR for MODEM_SQI            */
#define _MODEM_SQI_CHIPERROR_SHIFT                              16                                   /**< Shift value for MODEM_CHIPERROR             */
#define _MODEM_SQI_CHIPERROR_MASK                               0xFF0000UL                           /**< Bit mask for MODEM_CHIPERROR                */
#define _MODEM_SQI_CHIPERROR_DEFAULT                            0x00000000UL                         /**< Mode DEFAULT for MODEM_SQI                  */
#define MODEM_SQI_CHIPERROR_DEFAULT                             (_MODEM_SQI_CHIPERROR_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SQI          */

