SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_modem.h
/* Bit fields for MODEM SICTRL0 */
#define _MODEM_SICTRL0_RESETVALUE                               0x00000000UL                                     /**< Default value for MODEM_SICTRL0             */
#define _MODEM_SICTRL0_MASK                                     0x3FFFFFFFUL                                     /**< Mask for MODEM_SICTRL0                      */
#define _MODEM_SICTRL0_MODE_SHIFT                               0                                                /**< Shift value for MODEM_MODE                  */
#define _MODEM_SICTRL0_MODE_MASK                                0x3UL                                            /**< Bit mask for MODEM_MODE                     */
#define _MODEM_SICTRL0_MODE_DEFAULT                             0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL0              */
#define _MODEM_SICTRL0_MODE_DISABLE                             0x00000000UL                                     /**< Mode DISABLE for MODEM_SICTRL0              */
#define _MODEM_SICTRL0_MODE_ZB                                  0x00000001UL                                     /**< Mode ZB for MODEM_SICTRL0                   */
#define _MODEM_SICTRL0_MODE_BLE2                                0x00000002UL                                     /**< Mode BLE2 for MODEM_SICTRL0                 */
#define _MODEM_SICTRL0_MODE_BLE1                                0x00000003UL                                     /**< Mode BLE1 for MODEM_SICTRL0                 */
#define MODEM_SICTRL0_MODE_DEFAULT                              (_MODEM_SICTRL0_MODE_DEFAULT << 0)               /**< Shifted mode DEFAULT for MODEM_SICTRL0      */
#define MODEM_SICTRL0_MODE_DISABLE                              (_MODEM_SICTRL0_MODE_DISABLE << 0)               /**< Shifted mode DISABLE for MODEM_SICTRL0      */
#define MODEM_SICTRL0_MODE_ZB                                   (_MODEM_SICTRL0_MODE_ZB << 0)                    /**< Shifted mode ZB for MODEM_SICTRL0           */
#define MODEM_SICTRL0_MODE_BLE2                                 (_MODEM_SICTRL0_MODE_BLE2 << 0)                  /**< Shifted mode BLE2 for MODEM_SICTRL0         */
#define MODEM_SICTRL0_MODE_BLE1                                 (_MODEM_SICTRL0_MODE_BLE1 << 0)                  /**< Shifted mode BLE1 for MODEM_SICTRL0         */
#define _MODEM_SICTRL0_NOISETHRESH_SHIFT                        2                                                /**< Shift value for MODEM_NOISETHRESH           */
#define _MODEM_SICTRL0_NOISETHRESH_MASK                         0x3FCUL                                          /**< Bit mask for MODEM_NOISETHRESH              */
#define _MODEM_SICTRL0_NOISETHRESH_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL0              */
#define MODEM_SICTRL0_NOISETHRESH_DEFAULT                       (_MODEM_SICTRL0_NOISETHRESH_DEFAULT << 2)        /**< Shifted mode DEFAULT for MODEM_SICTRL0      */
#define _MODEM_SICTRL0_PEAKNUMTHRESHLW_SHIFT                    10                                               /**< Shift value for MODEM_PEAKNUMTHRESHLW       */
#define _MODEM_SICTRL0_PEAKNUMTHRESHLW_MASK                     0x7C00UL                                         /**< Bit mask for MODEM_PEAKNUMTHRESHLW          */
#define _MODEM_SICTRL0_PEAKNUMTHRESHLW_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL0              */
#define MODEM_SICTRL0_PEAKNUMTHRESHLW_DEFAULT                   (_MODEM_SICTRL0_PEAKNUMTHRESHLW_DEFAULT << 10)   /**< Shifted mode DEFAULT for MODEM_SICTRL0      */
#define _MODEM_SICTRL0_PEAKNUMTHRESHSW_SHIFT                    15                                               /**< Shift value for MODEM_PEAKNUMTHRESHSW       */
#define _MODEM_SICTRL0_PEAKNUMTHRESHSW_MASK                     0x38000UL                                        /**< Bit mask for MODEM_PEAKNUMTHRESHSW          */
#define _MODEM_SICTRL0_PEAKNUMTHRESHSW_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL0              */
#define MODEM_SICTRL0_PEAKNUMTHRESHSW_DEFAULT                   (_MODEM_SICTRL0_PEAKNUMTHRESHSW_DEFAULT << 15)   /**< Shifted mode DEFAULT for MODEM_SICTRL0      */
#define _MODEM_SICTRL0_SMALLSAMPLETHRESH_SHIFT                  18                                               /**< Shift value for MODEM_SMALLSAMPLETHRESH     */
#define _MODEM_SICTRL0_SMALLSAMPLETHRESH_MASK                   0x7C0000UL                                       /**< Bit mask for MODEM_SMALLSAMPLETHRESH        */
#define _MODEM_SICTRL0_SMALLSAMPLETHRESH_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL0              */
#define MODEM_SICTRL0_SMALLSAMPLETHRESH_DEFAULT                 (_MODEM_SICTRL0_SMALLSAMPLETHRESH_DEFAULT << 18) /**< Shifted mode DEFAULT for MODEM_SICTRL0      */
#define _MODEM_SICTRL0_FREQNOMINAL_SHIFT                        23                                               /**< Shift value for MODEM_FREQNOMINAL           */
#define _MODEM_SICTRL0_FREQNOMINAL_MASK                         0x3F800000UL                                     /**< Bit mask for MODEM_FREQNOMINAL              */
#define _MODEM_SICTRL0_FREQNOMINAL_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL0              */
#define MODEM_SICTRL0_FREQNOMINAL_DEFAULT                       (_MODEM_SICTRL0_FREQNOMINAL_DEFAULT << 23)       /**< Shifted mode DEFAULT for MODEM_SICTRL0      */

/* Bit fields for MODEM SICTRL1 */
#define _MODEM_SICTRL1_RESETVALUE                               0x00000000UL                                     /**< Default value for MODEM_SICTRL1             */
#define _MODEM_SICTRL1_MASK                                     0xFFFFFFFFUL                                     /**< Mask for MODEM_SICTRL1                      */
#define _MODEM_SICTRL1_SUPERCHIPTOLERANCE_SHIFT                 0                                                /**< Shift value for MODEM_SUPERCHIPTOLERANCE    */
#define _MODEM_SICTRL1_SUPERCHIPTOLERANCE_MASK                  0x1FUL                                           /**< Bit mask for MODEM_SUPERCHIPTOLERANCE       */
#define _MODEM_SICTRL1_SUPERCHIPTOLERANCE_DEFAULT               0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL1              */
#define MODEM_SICTRL1_SUPERCHIPTOLERANCE_DEFAULT                (_MODEM_SICTRL1_SUPERCHIPTOLERANCE_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_SICTRL1      */
#define _MODEM_SICTRL1_SUPERCHIPMEDIAN_SHIFT                    5                                                /**< Shift value for MODEM_SUPERCHIPMEDIAN       */
#define _MODEM_SICTRL1_SUPERCHIPMEDIAN_MASK                     0xFE0UL                                          /**< Bit mask for MODEM_SUPERCHIPMEDIAN          */
#define _MODEM_SICTRL1_SUPERCHIPMEDIAN_DEFAULT                  0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL1              */
#define MODEM_SICTRL1_SUPERCHIPMEDIAN_DEFAULT                   (_MODEM_SICTRL1_SUPERCHIPMEDIAN_DEFAULT << 5)    /**< Shifted mode DEFAULT for MODEM_SICTRL1      */
#define _MODEM_SICTRL1_CORRTHRESH_SHIFT                         12                                               /**< Shift value for MODEM_CORRTHRESH            */
#define _MODEM_SICTRL1_CORRTHRESH_MASK                          0x7FF000UL                                       /**< Bit mask for MODEM_CORRTHRESH               */
#define _MODEM_SICTRL1_CORRTHRESH_DEFAULT                       0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL1              */
#define MODEM_SICTRL1_CORRTHRESH_DEFAULT                        (_MODEM_SICTRL1_CORRTHRESH_DEFAULT << 12)        /**< Shifted mode DEFAULT for MODEM_SICTRL1      */
#define _MODEM_SICTRL1_CORRNUM_SHIFT                            23                                               /**< Shift value for MODEM_CORRNUM               */
#define _MODEM_SICTRL1_CORRNUM_MASK                             0x3800000UL                                      /**< Bit mask for MODEM_CORRNUM                  */
#define _MODEM_SICTRL1_CORRNUM_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL1              */
#define MODEM_SICTRL1_CORRNUM_DEFAULT                           (_MODEM_SICTRL1_CORRNUM_DEFAULT << 23)           /**< Shifted mode DEFAULT for MODEM_SICTRL1      */
#define MODEM_SICTRL1_FASTMODE                                  (0x1UL << 26)                                    /**< Zigbee fast mode                            */
#define _MODEM_SICTRL1_FASTMODE_SHIFT                           26                                               /**< Shift value for MODEM_FASTMODE              */
#define _MODEM_SICTRL1_FASTMODE_MASK                            0x4000000UL                                      /**< Bit mask for MODEM_FASTMODE                 */
#define _MODEM_SICTRL1_FASTMODE_DEFAULT                         0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL1              */
#define MODEM_SICTRL1_FASTMODE_DEFAULT                          (_MODEM_SICTRL1_FASTMODE_DEFAULT << 26)          /**< Shifted mode DEFAULT for MODEM_SICTRL1      */
#define _MODEM_SICTRL1_NARROWPULSETHRESH_SHIFT                  27                                               /**< Shift value for MODEM_NARROWPULSETHRESH     */
#define _MODEM_SICTRL1_NARROWPULSETHRESH_MASK                   0xF8000000UL                                     /**< Bit mask for MODEM_NARROWPULSETHRESH        */
#define _MODEM_SICTRL1_NARROWPULSETHRESH_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for MODEM_SICTRL1              */
#define MODEM_SICTRL1_NARROWPULSETHRESH_DEFAULT                 (_MODEM_SICTRL1_NARROWPULSETHRESH_DEFAULT << 27) /**< Shifted mode DEFAULT for MODEM_SICTRL1      */

/* Bit fields for MODEM SISTATUS */
#define _MODEM_SISTATUS_RESETVALUE                              0x00000000UL                                  /**< Default value for MODEM_SISTATUS            */
#define _MODEM_SISTATUS_MASK                                    0x67FFFFFFUL                                  /**< Mask for MODEM_SISTATUS                     */
#define _MODEM_SISTATUS_SISTATE_SHIFT                           0                                             /**< Shift value for MODEM_SISTATE               */
#define _MODEM_SISTATUS_SISTATE_MASK                            0xFUL                                         /**< Bit mask for MODEM_SISTATE                  */
#define _MODEM_SISTATUS_SISTATE_DEFAULT                         0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_SISTATE_DEFAULT                          (_MODEM_SISTATUS_SISTATE_DEFAULT << 0)        /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define MODEM_SISTATUS_NOISE                                    (0x1UL << 4)                                  /**< Noisy short window                          */
#define _MODEM_SISTATUS_NOISE_SHIFT                             4                                             /**< Shift value for MODEM_NOISE                 */
#define _MODEM_SISTATUS_NOISE_MASK                              0x10UL                                        /**< Bit mask for MODEM_NOISE                    */
#define _MODEM_SISTATUS_NOISE_DEFAULT                           0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_NOISE_DEFAULT                            (_MODEM_SISTATUS_NOISE_DEFAULT << 4)          /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define _MODEM_SISTATUS_LWPEAKCOUNT_SHIFT                       5                                             /**< Shift value for MODEM_LWPEAKCOUNT           */
#define _MODEM_SISTATUS_LWPEAKCOUNT_MASK                        0x3E0UL                                       /**< Bit mask for MODEM_LWPEAKCOUNT              */
#define _MODEM_SISTATUS_LWPEAKCOUNT_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_LWPEAKCOUNT_DEFAULT                      (_MODEM_SISTATUS_LWPEAKCOUNT_DEFAULT << 5)    /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define _MODEM_SISTATUS_NARROWCOUNT_SHIFT                       10                                            /**< Shift value for MODEM_NARROWCOUNT           */
#define _MODEM_SISTATUS_NARROWCOUNT_MASK                        0x7C00UL                                      /**< Bit mask for MODEM_NARROWCOUNT              */
#define _MODEM_SISTATUS_NARROWCOUNT_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_NARROWCOUNT_DEFAULT                      (_MODEM_SISTATUS_NARROWCOUNT_DEFAULT << 10)   /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define MODEM_SISTATUS_TIMELOCK                                 (0x1UL << 15)                                 /**< Timing locked                               */
#define _MODEM_SISTATUS_TIMELOCK_SHIFT                          15                                            /**< Shift value for MODEM_TIMELOCK              */
#define _MODEM_SISTATUS_TIMELOCK_MASK                           0x8000UL                                      /**< Bit mask for MODEM_TIMELOCK                 */
#define _MODEM_SISTATUS_TIMELOCK_DEFAULT                        0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_TIMELOCK_DEFAULT                         (_MODEM_SISTATUS_TIMELOCK_DEFAULT << 15)      /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define MODEM_SISTATUS_SUPERCHIPFAIL                            (0x1UL << 16)                                 /**< Superchip fail                              */
#define _MODEM_SISTATUS_SUPERCHIPFAIL_SHIFT                     16                                            /**< Shift value for MODEM_SUPERCHIPFAIL         */
#define _MODEM_SISTATUS_SUPERCHIPFAIL_MASK                      0x10000UL                                     /**< Bit mask for MODEM_SUPERCHIPFAIL            */
#define _MODEM_SISTATUS_SUPERCHIPFAIL_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_SUPERCHIPFAIL_DEFAULT                    (_MODEM_SISTATUS_SUPERCHIPFAIL_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define MODEM_SISTATUS_SUPERCHIPPASS                            (0x1UL << 17)                                 /**< Superchip pass                              */
#define _MODEM_SISTATUS_SUPERCHIPPASS_SHIFT                     17                                            /**< Shift value for MODEM_SUPERCHIPPASS         */
#define _MODEM_SISTATUS_SUPERCHIPPASS_MASK                      0x20000UL                                     /**< Bit mask for MODEM_SUPERCHIPPASS            */
#define _MODEM_SISTATUS_SUPERCHIPPASS_DEFAULT                   0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_SUPERCHIPPASS_DEFAULT                    (_MODEM_SISTATUS_SUPERCHIPPASS_DEFAULT << 17) /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define _MODEM_SISTATUS_TIMEOFFSET_SHIFT                        18                                            /**< Shift value for MODEM_TIMEOFFSET            */
#define _MODEM_SISTATUS_TIMEOFFSET_MASK                         0x1C0000UL                                    /**< Bit mask for MODEM_TIMEOFFSET               */
#define _MODEM_SISTATUS_TIMEOFFSET_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_TIMEOFFSET_DEFAULT                       (_MODEM_SISTATUS_TIMEOFFSET_DEFAULT << 18)    /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define _MODEM_SISTATUS_CORRPASSNUM_SHIFT                       21                                            /**< Shift value for MODEM_CORRPASSNUM           */
#define _MODEM_SISTATUS_CORRPASSNUM_MASK                        0x7E00000UL                                   /**< Bit mask for MODEM_CORRPASSNUM              */
#define _MODEM_SISTATUS_CORRPASSNUM_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_CORRPASSNUM_DEFAULT                      (_MODEM_SISTATUS_CORRPASSNUM_DEFAULT << 21)   /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define MODEM_SISTATUS_SNIFFDONE                                (0x1UL << 29)                                 /**< Sniff done                                  */
#define _MODEM_SISTATUS_SNIFFDONE_SHIFT                         29                                            /**< Shift value for MODEM_SNIFFDONE             */
#define _MODEM_SISTATUS_SNIFFDONE_MASK                          0x20000000UL                                  /**< Bit mask for MODEM_SNIFFDONE                */
#define _MODEM_SISTATUS_SNIFFDONE_DEFAULT                       0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_SNIFFDONE_DEFAULT                        (_MODEM_SISTATUS_SNIFFDONE_DEFAULT << 29)     /**< Shifted mode DEFAULT for MODEM_SISTATUS     */
#define MODEM_SISTATUS_SIDET                                    (0x1UL << 30)                                 /**< Signal detected                             */
#define _MODEM_SISTATUS_SIDET_SHIFT                             30                                            /**< Shift value for MODEM_SIDET                 */
#define _MODEM_SISTATUS_SIDET_MASK                              0x40000000UL                                  /**< Bit mask for MODEM_SIDET                    */
#define _MODEM_SISTATUS_SIDET_DEFAULT                           0x00000000UL                                  /**< Mode DEFAULT for MODEM_SISTATUS             */
#define MODEM_SISTATUS_SIDET_DEFAULT                            (_MODEM_SISTATUS_SIDET_DEFAULT << 30)         /**< Shifted mode DEFAULT for MODEM_SISTATUS     */

/* Bit fields for MODEM CFGANTPATTEXT */
#define _MODEM_CFGANTPATTEXT_RESETVALUE                         0x00000000UL                                         /**< Default value for MODEM_CFGANTPATTEXT       */
#define _MODEM_CFGANTPATTEXT_MASK                               0x3FFFFFFFUL                                         /**< Mask for MODEM_CFGANTPATTEXT                */
#define _MODEM_CFGANTPATTEXT_CFGANTPATTVALEXT_SHIFT             0                                                    /**< Shift value for MODEM_CFGANTPATTVALEXT      */
#define _MODEM_CFGANTPATTEXT_CFGANTPATTVALEXT_MASK              0x3FFFFFFFUL                                         /**< Bit mask for MODEM_CFGANTPATTVALEXT         */
#define _MODEM_CFGANTPATTEXT_CFGANTPATTVALEXT_DEFAULT           0x00000000UL                                         /**< Mode DEFAULT for MODEM_CFGANTPATTEXT        */
#define MODEM_CFGANTPATTEXT_CFGANTPATTVALEXT_DEFAULT            (_MODEM_CFGANTPATTEXT_CFGANTPATTVALEXT_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_CFGANTPATTEXT*/

