SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_modem.h
/* Bit fields for MODEM SICTRL2 */
#define _MODEM_SICTRL2_RESETVALUE                               0x00000000UL                                  /**< Default value for MODEM_SICTRL2             */
#define _MODEM_SICTRL2_MASK                                     0x000000FFUL                                  /**< Mask for MODEM_SICTRL2                      */
#define MODEM_SICTRL2_SIRSTAGCMODE                              (0x1UL << 0)                                  /**< SI reset by AGC                             */
#define _MODEM_SICTRL2_SIRSTAGCMODE_SHIFT                       0                                             /**< Shift value for MODEM_SIRSTAGCMODE          */
#define _MODEM_SICTRL2_SIRSTAGCMODE_MASK                        0x1UL                                         /**< Bit mask for MODEM_SIRSTAGCMODE             */
#define _MODEM_SICTRL2_SIRSTAGCMODE_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for MODEM_SICTRL2              */
#define MODEM_SICTRL2_SIRSTAGCMODE_DEFAULT                      (_MODEM_SICTRL2_SIRSTAGCMODE_DEFAULT << 0)    /**< Shifted mode DEFAULT for MODEM_SICTRL2      */
#define MODEM_SICTRL2_SIRSTPRSMODE                              (0x1UL << 1)                                  /**< SI reset by PRS PAEN                        */
#define _MODEM_SICTRL2_SIRSTPRSMODE_SHIFT                       1                                             /**< Shift value for MODEM_SIRSTPRSMODE          */
#define _MODEM_SICTRL2_SIRSTPRSMODE_MASK                        0x2UL                                         /**< Bit mask for MODEM_SIRSTPRSMODE             */
#define _MODEM_SICTRL2_SIRSTPRSMODE_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for MODEM_SICTRL2              */
#define MODEM_SICTRL2_SIRSTPRSMODE_DEFAULT                      (_MODEM_SICTRL2_SIRSTPRSMODE_DEFAULT << 1)    /**< Shifted mode DEFAULT for MODEM_SICTRL2      */
#define MODEM_SICTRL2_SIRSTCCAMODE                              (0x1UL << 2)                                  /**< SI reset by CCA req                         */
#define _MODEM_SICTRL2_SIRSTCCAMODE_SHIFT                       2                                             /**< Shift value for MODEM_SIRSTCCAMODE          */
#define _MODEM_SICTRL2_SIRSTCCAMODE_MASK                        0x4UL                                         /**< Bit mask for MODEM_SIRSTCCAMODE             */
#define _MODEM_SICTRL2_SIRSTCCAMODE_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for MODEM_SICTRL2              */
#define MODEM_SICTRL2_SIRSTCCAMODE_DEFAULT                      (_MODEM_SICTRL2_SIRSTCCAMODE_DEFAULT << 2)    /**< Shifted mode DEFAULT for MODEM_SICTRL2      */
#define _MODEM_SICTRL2_SUPERCHIPTHRESH_SHIFT                    3                                             /**< Shift value for MODEM_SUPERCHIPTHRESH       */
#define _MODEM_SICTRL2_SUPERCHIPTHRESH_MASK                     0x38UL                                        /**< Bit mask for MODEM_SUPERCHIPTHRESH          */
#define _MODEM_SICTRL2_SUPERCHIPTHRESH_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for MODEM_SICTRL2              */
#define MODEM_SICTRL2_SUPERCHIPTHRESH_DEFAULT                   (_MODEM_SICTRL2_SUPERCHIPTHRESH_DEFAULT << 3) /**< Shifted mode DEFAULT for MODEM_SICTRL2      */
#define MODEM_SICTRL2_DISSIFRAMEDET                             (0x1UL << 6)                                  /**< Disable SI when framedet                    */
#define _MODEM_SICTRL2_DISSIFRAMEDET_SHIFT                      6                                             /**< Shift value for MODEM_DISSIFRAMEDET         */
#define _MODEM_SICTRL2_DISSIFRAMEDET_MASK                       0x40UL                                        /**< Bit mask for MODEM_DISSIFRAMEDET            */
#define _MODEM_SICTRL2_DISSIFRAMEDET_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for MODEM_SICTRL2              */
#define MODEM_SICTRL2_DISSIFRAMEDET_DEFAULT                     (_MODEM_SICTRL2_DISSIFRAMEDET_DEFAULT << 6)   /**< Shifted mode DEFAULT for MODEM_SICTRL2      */
#define MODEM_SICTRL2_AGCRSTUPONSI                              (0x1UL << 7)                                  /**< AGC reset on SI reset                       */
#define _MODEM_SICTRL2_AGCRSTUPONSI_SHIFT                       7                                             /**< Shift value for MODEM_AGCRSTUPONSI          */
#define _MODEM_SICTRL2_AGCRSTUPONSI_MASK                        0x80UL                                        /**< Bit mask for MODEM_AGCRSTUPONSI             */
#define _MODEM_SICTRL2_AGCRSTUPONSI_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for MODEM_SICTRL2              */
#define MODEM_SICTRL2_AGCRSTUPONSI_DEFAULT                      (_MODEM_SICTRL2_AGCRSTUPONSI_DEFAULT << 7)    /**< Shifted mode DEFAULT for MODEM_SICTRL2      */

/* Bit fields for MODEM CHFSWCTRL */
#define _MODEM_CHFSWCTRL_RESETVALUE                             0x00000000UL                              /**< Default value for MODEM_CHFSWCTRL           */
#define _MODEM_CHFSWCTRL_MASK                                   0x0003FFFFUL                              /**< Mask for MODEM_CHFSWCTRL                    */
#define _MODEM_CHFSWCTRL_CHFSWTIME_SHIFT                        0                                         /**< Shift value for MODEM_CHFSWTIME             */
#define _MODEM_CHFSWCTRL_CHFSWTIME_MASK                         0x3FFFFUL                                 /**< Bit mask for MODEM_CHFSWTIME                */
#define _MODEM_CHFSWCTRL_CHFSWTIME_DEFAULT                      0x00000000UL                              /**< Mode DEFAULT for MODEM_CHFSWCTRL            */
#define MODEM_CHFSWCTRL_CHFSWTIME_DEFAULT                       (_MODEM_CHFSWCTRL_CHFSWTIME_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_CHFSWCTRL    */

/* Bit fields for MODEM IRCAL */
#define _MODEM_IRCAL_RESETVALUE                                 0x00000000UL                                 /**< Default value for MODEM_IRCAL               */
#define _MODEM_IRCAL_MASK                                       0x0000FFBFUL                                 /**< Mask for MODEM_IRCAL                        */
#define MODEM_IRCAL_IRCALEN                                     (0x1UL << 0)                                 /**< IRCAL enable bit                            */
#define _MODEM_IRCAL_IRCALEN_SHIFT                              0                                            /**< Shift value for MODEM_IRCALEN               */
#define _MODEM_IRCAL_IRCALEN_MASK                               0x1UL                                        /**< Bit mask for MODEM_IRCALEN                  */
#define _MODEM_IRCAL_IRCALEN_DEFAULT                            0x00000000UL                                 /**< Mode DEFAULT for MODEM_IRCAL                */
#define MODEM_IRCAL_IRCALEN_DEFAULT                             (_MODEM_IRCAL_IRCALEN_DEFAULT << 0)          /**< Shifted mode DEFAULT for MODEM_IRCAL        */
#define _MODEM_IRCAL_MURSHF_SHIFT                               1                                            /**< Shift value for MODEM_MURSHF                */
#define _MODEM_IRCAL_MURSHF_MASK                                0x3EUL                                       /**< Bit mask for MODEM_MURSHF                   */
#define _MODEM_IRCAL_MURSHF_DEFAULT                             0x00000000UL                                 /**< Mode DEFAULT for MODEM_IRCAL                */
#define MODEM_IRCAL_MURSHF_DEFAULT                              (_MODEM_IRCAL_MURSHF_DEFAULT << 1)           /**< Shifted mode DEFAULT for MODEM_IRCAL        */
#define _MODEM_IRCAL_MUISHF_SHIFT                               7                                            /**< Shift value for MODEM_MUISHF                */
#define _MODEM_IRCAL_MUISHF_MASK                                0x1F80UL                                     /**< Bit mask for MODEM_MUISHF                   */
#define _MODEM_IRCAL_MUISHF_DEFAULT                             0x00000000UL                                 /**< Mode DEFAULT for MODEM_IRCAL                */
#define MODEM_IRCAL_MUISHF_DEFAULT                              (_MODEM_IRCAL_MUISHF_DEFAULT << 7)           /**< Shifted mode DEFAULT for MODEM_IRCAL        */
#define MODEM_IRCAL_IRCORREN                                    (0x1UL << 13)                                /**< IR Correction enable bit                    */
#define _MODEM_IRCAL_IRCORREN_SHIFT                             13                                           /**< Shift value for MODEM_IRCORREN              */
#define _MODEM_IRCAL_IRCORREN_MASK                              0x2000UL                                     /**< Bit mask for MODEM_IRCORREN                 */
#define _MODEM_IRCAL_IRCORREN_DEFAULT                           0x00000000UL                                 /**< Mode DEFAULT for MODEM_IRCAL                */
#define MODEM_IRCAL_IRCORREN_DEFAULT                            (_MODEM_IRCAL_IRCORREN_DEFAULT << 13)        /**< Shifted mode DEFAULT for MODEM_IRCAL        */
#define MODEM_IRCAL_IRCALCOEFRSTCMD                             (0x1UL << 14)                                /**< IRCAL coef reset cmd                        */
#define _MODEM_IRCAL_IRCALCOEFRSTCMD_SHIFT                      14                                           /**< Shift value for MODEM_IRCALCOEFRSTCMD       */
#define _MODEM_IRCAL_IRCALCOEFRSTCMD_MASK                       0x4000UL                                     /**< Bit mask for MODEM_IRCALCOEFRSTCMD          */
#define _MODEM_IRCAL_IRCALCOEFRSTCMD_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_IRCAL                */
#define MODEM_IRCAL_IRCALCOEFRSTCMD_DEFAULT                     (_MODEM_IRCAL_IRCALCOEFRSTCMD_DEFAULT << 14) /**< Shifted mode DEFAULT for MODEM_IRCAL        */
#define MODEM_IRCAL_IRCALIFADCDBG                               (0x1UL << 15)                                /**< IRCAL IFADC DBG                             */
#define _MODEM_IRCAL_IRCALIFADCDBG_SHIFT                        15                                           /**< Shift value for MODEM_IRCALIFADCDBG         */
#define _MODEM_IRCAL_IRCALIFADCDBG_MASK                         0x8000UL                                     /**< Bit mask for MODEM_IRCALIFADCDBG            */
#define _MODEM_IRCAL_IRCALIFADCDBG_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for MODEM_IRCAL                */
#define MODEM_IRCAL_IRCALIFADCDBG_DEFAULT                       (_MODEM_IRCAL_IRCALIFADCDBG_DEFAULT << 15)   /**< Shifted mode DEFAULT for MODEM_IRCAL        */

/* Bit fields for MODEM IRCALCOEF */
#define _MODEM_IRCALCOEF_RESETVALUE                             0x00000000UL                         /**< Default value for MODEM_IRCALCOEF           */
#define _MODEM_IRCALCOEF_MASK                                   0x7FFF7FFFUL                         /**< Mask for MODEM_IRCALCOEF                    */
#define _MODEM_IRCALCOEF_CRV_SHIFT                              0                                    /**< Shift value for MODEM_CRV                   */
#define _MODEM_IRCALCOEF_CRV_MASK                               0x7FFFUL                             /**< Bit mask for MODEM_CRV                      */
#define _MODEM_IRCALCOEF_CRV_DEFAULT                            0x00000000UL                         /**< Mode DEFAULT for MODEM_IRCALCOEF            */
#define MODEM_IRCALCOEF_CRV_DEFAULT                             (_MODEM_IRCALCOEF_CRV_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_IRCALCOEF    */
#define _MODEM_IRCALCOEF_CIV_SHIFT                              16                                   /**< Shift value for MODEM_CIV                   */
#define _MODEM_IRCALCOEF_CIV_MASK                               0x7FFF0000UL                         /**< Bit mask for MODEM_CIV                      */
#define _MODEM_IRCALCOEF_CIV_DEFAULT                            0x00000000UL                         /**< Mode DEFAULT for MODEM_IRCALCOEF            */
#define MODEM_IRCALCOEF_CIV_DEFAULT                             (_MODEM_IRCALCOEF_CIV_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_IRCALCOEF    */

/* Bit fields for MODEM IRCALCOEFWR */
#define _MODEM_IRCALCOEFWR_RESETVALUE                           0x00000000UL                              /**< Default value for MODEM_IRCALCOEFWR         */
#define _MODEM_IRCALCOEFWR_MASK                                 0xFFFFFFFFUL                              /**< Mask for MODEM_IRCALCOEFWR                  */
#define _MODEM_IRCALCOEFWR_CRVWD_SHIFT                          0                                         /**< Shift value for MODEM_CRVWD                 */
#define _MODEM_IRCALCOEFWR_CRVWD_MASK                           0x7FFFUL                                  /**< Bit mask for MODEM_CRVWD                    */
#define _MODEM_IRCALCOEFWR_CRVWD_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for MODEM_IRCALCOEFWR          */
#define MODEM_IRCALCOEFWR_CRVWD_DEFAULT                         (_MODEM_IRCALCOEFWR_CRVWD_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_IRCALCOEFWR  */
#define MODEM_IRCALCOEFWR_CRVWEN                                (0x1UL << 15)                             /**< CIV Coefficient Write Enable                */
#define _MODEM_IRCALCOEFWR_CRVWEN_SHIFT                         15                                        /**< Shift value for MODEM_CRVWEN                */
#define _MODEM_IRCALCOEFWR_CRVWEN_MASK                          0x8000UL                                  /**< Bit mask for MODEM_CRVWEN                   */
#define _MODEM_IRCALCOEFWR_CRVWEN_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for MODEM_IRCALCOEFWR          */
#define MODEM_IRCALCOEFWR_CRVWEN_DEFAULT                        (_MODEM_IRCALCOEFWR_CRVWEN_DEFAULT << 15) /**< Shifted mode DEFAULT for MODEM_IRCALCOEFWR  */
#define _MODEM_IRCALCOEFWR_CIVWD_SHIFT                          16                                        /**< Shift value for MODEM_CIVWD                 */
#define _MODEM_IRCALCOEFWR_CIVWD_MASK                           0x7FFF0000UL                              /**< Bit mask for MODEM_CIVWD                    */
#define _MODEM_IRCALCOEFWR_CIVWD_DEFAULT                        0x00000000UL                              /**< Mode DEFAULT for MODEM_IRCALCOEFWR          */
#define MODEM_IRCALCOEFWR_CIVWD_DEFAULT                         (_MODEM_IRCALCOEFWR_CIVWD_DEFAULT << 16)  /**< Shifted mode DEFAULT for MODEM_IRCALCOEFWR  */
#define MODEM_IRCALCOEFWR_CIVWEN                                (0x1UL << 31)                             /**< CIV Coefficient Write Enable                */
#define _MODEM_IRCALCOEFWR_CIVWEN_SHIFT                         31                                        /**< Shift value for MODEM_CIVWEN                */
#define _MODEM_IRCALCOEFWR_CIVWEN_MASK                          0x80000000UL                              /**< Bit mask for MODEM_CIVWEN                   */
#define _MODEM_IRCALCOEFWR_CIVWEN_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for MODEM_IRCALCOEFWR          */
#define MODEM_IRCALCOEFWR_CIVWEN_DEFAULT                        (_MODEM_IRCALCOEFWR_CIVWEN_DEFAULT << 31) /**< Shifted mode DEFAULT for MODEM_IRCALCOEFWR  */

/* Bit fields for MODEM ADCTRL1 */
#define _MODEM_ADCTRL1_RESETVALUE                               0x00080000UL                          /**< Default value for MODEM_ADCTRL1             */
#define _MODEM_ADCTRL1_MASK                                     0xFFFFFFFFUL                          /**< Mask for MODEM_ADCTRL1                      */
#define _MODEM_ADCTRL1_ADCTRL1_SHIFT                            0                                     /**< Shift value for MODEM_ADCTRL1               */
#define _MODEM_ADCTRL1_ADCTRL1_MASK                             0xFFFFFFFFUL                          /**< Bit mask for MODEM_ADCTRL1                  */
#define _MODEM_ADCTRL1_ADCTRL1_DEFAULT                          0x00080000UL                          /**< Mode DEFAULT for MODEM_ADCTRL1              */
#define MODEM_ADCTRL1_ADCTRL1_DEFAULT                           (_MODEM_ADCTRL1_ADCTRL1_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADCTRL1      */

/* Bit fields for MODEM ADCTRL2 */
#define _MODEM_ADCTRL2_RESETVALUE                               0x00000001UL                          /**< Default value for MODEM_ADCTRL2             */
#define _MODEM_ADCTRL2_MASK                                     0xFFFFFFFFUL                          /**< Mask for MODEM_ADCTRL2                      */
#define _MODEM_ADCTRL2_ADCTRL2_SHIFT                            0                                     /**< Shift value for MODEM_ADCTRL2               */
#define _MODEM_ADCTRL2_ADCTRL2_MASK                             0xFFFFFFFFUL                          /**< Bit mask for MODEM_ADCTRL2                  */
#define _MODEM_ADCTRL2_ADCTRL2_DEFAULT                          0x00000001UL                          /**< Mode DEFAULT for MODEM_ADCTRL2              */
#define MODEM_ADCTRL2_ADCTRL2_DEFAULT                           (_MODEM_ADCTRL2_ADCTRL2_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_ADCTRL2      */

/* Bit fields for MODEM ADQUAL0 */
#define _MODEM_ADQUAL0_RESETVALUE                               0x00000000UL                           /**< Default value for MODEM_ADQUAL0             */
#define _MODEM_ADQUAL0_MASK                                     0x03FF03FFUL                           /**< Mask for MODEM_ADQUAL0                      */
#define _MODEM_ADQUAL0_ADRSSI0_SHIFT                            0                                      /**< Shift value for MODEM_ADRSSI0               */
#define _MODEM_ADQUAL0_ADRSSI0_MASK                             0x3FFUL                                /**< Bit mask for MODEM_ADRSSI0                  */
#define _MODEM_ADQUAL0_ADRSSI0_DEFAULT                          0x00000000UL                           /**< Mode DEFAULT for MODEM_ADQUAL0              */
#define MODEM_ADQUAL0_ADRSSI0_DEFAULT                           (_MODEM_ADQUAL0_ADRSSI0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_ADQUAL0      */
#define _MODEM_ADQUAL0_ADRSSI1_SHIFT                            16                                     /**< Shift value for MODEM_ADRSSI1               */
#define _MODEM_ADQUAL0_ADRSSI1_MASK                             0x3FF0000UL                            /**< Bit mask for MODEM_ADRSSI1                  */
#define _MODEM_ADQUAL0_ADRSSI1_DEFAULT                          0x00000000UL                           /**< Mode DEFAULT for MODEM_ADQUAL0              */
#define MODEM_ADQUAL0_ADRSSI1_DEFAULT                           (_MODEM_ADQUAL0_ADRSSI1_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_ADQUAL0      */

