SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM24/Include/mgm24_modem.h
/* Bit fields for MODEM HADMSTATUS1 */
#define _MODEM_HADMSTATUS1_RESETVALUE                           0x00000000UL                                 /**< Default value for MODEM_HADMSTATUS1         */
#define _MODEM_HADMSTATUS1_MASK                                 0xFFFFFFFFUL                                 /**< Mask for MODEM_HADMSTATUS1                  */
#define _MODEM_HADMSTATUS1_FREQOFFSET_SHIFT                     0                                            /**< Shift value for MODEM_FREQOFFSET            */
#define _MODEM_HADMSTATUS1_FREQOFFSET_MASK                      0xFFFFUL                                     /**< Bit mask for MODEM_FREQOFFSET               */
#define _MODEM_HADMSTATUS1_FREQOFFSET_DEFAULT                   0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS1          */
#define MODEM_HADMSTATUS1_FREQOFFSET_DEFAULT                    (_MODEM_HADMSTATUS1_FREQOFFSET_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS1  */
#define _MODEM_HADMSTATUS1_TIMETOX_SHIFT                        16                                           /**< Shift value for MODEM_TIMETOX               */
#define _MODEM_HADMSTATUS1_TIMETOX_MASK                         0xFFFF0000UL                                 /**< Bit mask for MODEM_TIMETOX                  */
#define _MODEM_HADMSTATUS1_TIMETOX_DEFAULT                      0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS1          */
#define MODEM_HADMSTATUS1_TIMETOX_DEFAULT                       (_MODEM_HADMSTATUS1_TIMETOX_DEFAULT << 16)   /**< Shifted mode DEFAULT for MODEM_HADMSTATUS1  */

/* Bit fields for MODEM HADMSTATUS2 */
#define _MODEM_HADMSTATUS2_RESETVALUE                           0x00000000UL                                 /**< Default value for MODEM_HADMSTATUS2         */
#define _MODEM_HADMSTATUS2_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_HADMSTATUS2                  */
#define _MODEM_HADMSTATUS2_COSTLATE1_SHIFT                      0                                            /**< Shift value for MODEM_COSTLATE1             */
#define _MODEM_HADMSTATUS2_COSTLATE1_MASK                       0x3FFUL                                      /**< Bit mask for MODEM_COSTLATE1                */
#define _MODEM_HADMSTATUS2_COSTLATE1_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS2          */
#define MODEM_HADMSTATUS2_COSTLATE1_DEFAULT                     (_MODEM_HADMSTATUS2_COSTLATE1_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_HADMSTATUS2  */
#define _MODEM_HADMSTATUS2_COSTCURR1_SHIFT                      10                                           /**< Shift value for MODEM_COSTCURR1             */
#define _MODEM_HADMSTATUS2_COSTCURR1_MASK                       0xFFC00UL                                    /**< Bit mask for MODEM_COSTCURR1                */
#define _MODEM_HADMSTATUS2_COSTCURR1_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS2          */
#define MODEM_HADMSTATUS2_COSTCURR1_DEFAULT                     (_MODEM_HADMSTATUS2_COSTCURR1_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS2  */
#define _MODEM_HADMSTATUS2_COSTEARL1_SHIFT                      20                                           /**< Shift value for MODEM_COSTEARL1             */
#define _MODEM_HADMSTATUS2_COSTEARL1_MASK                       0x3FF00000UL                                 /**< Bit mask for MODEM_COSTEARL1                */
#define _MODEM_HADMSTATUS2_COSTEARL1_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS2          */
#define MODEM_HADMSTATUS2_COSTEARL1_DEFAULT                     (_MODEM_HADMSTATUS2_COSTEARL1_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS2  */

/* Bit fields for MODEM HADMSTATUS3 */
#define _MODEM_HADMSTATUS3_RESETVALUE                           0x00000000UL                                 /**< Default value for MODEM_HADMSTATUS3         */
#define _MODEM_HADMSTATUS3_MASK                                 0x3FFFFFFFUL                                 /**< Mask for MODEM_HADMSTATUS3                  */
#define _MODEM_HADMSTATUS3_COSTLATE0_SHIFT                      0                                            /**< Shift value for MODEM_COSTLATE0             */
#define _MODEM_HADMSTATUS3_COSTLATE0_MASK                       0x3FFUL                                      /**< Bit mask for MODEM_COSTLATE0                */
#define _MODEM_HADMSTATUS3_COSTLATE0_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS3          */
#define MODEM_HADMSTATUS3_COSTLATE0_DEFAULT                     (_MODEM_HADMSTATUS3_COSTLATE0_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_HADMSTATUS3  */
#define _MODEM_HADMSTATUS3_COSTCURR0_SHIFT                      10                                           /**< Shift value for MODEM_COSTCURR0             */
#define _MODEM_HADMSTATUS3_COSTCURR0_MASK                       0xFFC00UL                                    /**< Bit mask for MODEM_COSTCURR0                */
#define _MODEM_HADMSTATUS3_COSTCURR0_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS3          */
#define MODEM_HADMSTATUS3_COSTCURR0_DEFAULT                     (_MODEM_HADMSTATUS3_COSTCURR0_DEFAULT << 10) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS3  */
#define _MODEM_HADMSTATUS3_COSTEARL0_SHIFT                      20                                           /**< Shift value for MODEM_COSTEARL0             */
#define _MODEM_HADMSTATUS3_COSTEARL0_MASK                       0x3FF00000UL                                 /**< Bit mask for MODEM_COSTEARL0                */
#define _MODEM_HADMSTATUS3_COSTEARL0_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS3          */
#define MODEM_HADMSTATUS3_COSTEARL0_DEFAULT                     (_MODEM_HADMSTATUS3_COSTEARL0_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS3  */

/* Bit fields for MODEM HADMSTATUS4 */
#define _MODEM_HADMSTATUS4_RESETVALUE                           0x00000000UL                                /**< Default value for MODEM_HADMSTATUS4         */
#define _MODEM_HADMSTATUS4_MASK                                 0x7FFF7FFFUL                                /**< Mask for MODEM_HADMSTATUS4                  */
#define _MODEM_HADMSTATUS4_SBSP500I_SHIFT                       0                                           /**< Shift value for MODEM_SBSP500I              */
#define _MODEM_HADMSTATUS4_SBSP500I_MASK                        0x7FFFUL                                    /**< Bit mask for MODEM_SBSP500I                 */
#define _MODEM_HADMSTATUS4_SBSP500I_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_HADMSTATUS4          */
#define MODEM_HADMSTATUS4_SBSP500I_DEFAULT                      (_MODEM_HADMSTATUS4_SBSP500I_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_HADMSTATUS4  */
#define _MODEM_HADMSTATUS4_SBSP500Q_SHIFT                       16                                          /**< Shift value for MODEM_SBSP500Q              */
#define _MODEM_HADMSTATUS4_SBSP500Q_MASK                        0x7FFF0000UL                                /**< Bit mask for MODEM_SBSP500Q                 */
#define _MODEM_HADMSTATUS4_SBSP500Q_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_HADMSTATUS4          */
#define MODEM_HADMSTATUS4_SBSP500Q_DEFAULT                      (_MODEM_HADMSTATUS4_SBSP500Q_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS4  */

/* Bit fields for MODEM HADMSTATUS5 */
#define _MODEM_HADMSTATUS5_RESETVALUE                           0x00000000UL                                /**< Default value for MODEM_HADMSTATUS5         */
#define _MODEM_HADMSTATUS5_MASK                                 0x7FFF7FFFUL                                /**< Mask for MODEM_HADMSTATUS5                  */
#define _MODEM_HADMSTATUS5_SBSM500I_SHIFT                       0                                           /**< Shift value for MODEM_SBSM500I              */
#define _MODEM_HADMSTATUS5_SBSM500I_MASK                        0x7FFFUL                                    /**< Bit mask for MODEM_SBSM500I                 */
#define _MODEM_HADMSTATUS5_SBSM500I_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_HADMSTATUS5          */
#define MODEM_HADMSTATUS5_SBSM500I_DEFAULT                      (_MODEM_HADMSTATUS5_SBSM500I_DEFAULT << 0)  /**< Shifted mode DEFAULT for MODEM_HADMSTATUS5  */
#define _MODEM_HADMSTATUS5_SBSM500Q_SHIFT                       16                                          /**< Shift value for MODEM_SBSM500Q              */
#define _MODEM_HADMSTATUS5_SBSM500Q_MASK                        0x7FFF0000UL                                /**< Bit mask for MODEM_SBSM500Q                 */
#define _MODEM_HADMSTATUS5_SBSM500Q_DEFAULT                     0x00000000UL                                /**< Mode DEFAULT for MODEM_HADMSTATUS5          */
#define MODEM_HADMSTATUS5_SBSM500Q_DEFAULT                      (_MODEM_HADMSTATUS5_SBSM500Q_DEFAULT << 16) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS5  */

/* Bit fields for MODEM HADMSTATUS6 */
#define _MODEM_HADMSTATUS6_RESETVALUE                           0x00000000UL                                 /**< Default value for MODEM_HADMSTATUS6         */
#define _MODEM_HADMSTATUS6_MASK                                 0xFFF0FFFFUL                                 /**< Mask for MODEM_HADMSTATUS6                  */
#define _MODEM_HADMSTATUS6_FREQMEAS_SHIFT                       0                                            /**< Shift value for MODEM_FREQMEAS              */
#define _MODEM_HADMSTATUS6_FREQMEAS_MASK                        0xFFFFUL                                     /**< Bit mask for MODEM_FREQMEAS                 */
#define _MODEM_HADMSTATUS6_FREQMEAS_DEFAULT                     0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS6          */
#define MODEM_HADMSTATUS6_FREQMEAS_DEFAULT                      (_MODEM_HADMSTATUS6_FREQMEAS_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_HADMSTATUS6  */
#define _MODEM_HADMSTATUS6_SBSPSCALE_SHIFT                      20                                           /**< Shift value for MODEM_SBSPSCALE             */
#define _MODEM_HADMSTATUS6_SBSPSCALE_MASK                       0x3F00000UL                                  /**< Bit mask for MODEM_SBSPSCALE                */
#define _MODEM_HADMSTATUS6_SBSPSCALE_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS6          */
#define MODEM_HADMSTATUS6_SBSPSCALE_DEFAULT                     (_MODEM_HADMSTATUS6_SBSPSCALE_DEFAULT << 20) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS6  */
#define _MODEM_HADMSTATUS6_SBSMSCALE_SHIFT                      26                                           /**< Shift value for MODEM_SBSMSCALE             */
#define _MODEM_HADMSTATUS6_SBSMSCALE_MASK                       0xFC000000UL                                 /**< Bit mask for MODEM_SBSMSCALE                */
#define _MODEM_HADMSTATUS6_SBSMSCALE_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for MODEM_HADMSTATUS6          */
#define MODEM_HADMSTATUS6_SBSMSCALE_DEFAULT                     (_MODEM_HADMSTATUS6_SBSMSCALE_DEFAULT << 26) /**< Shifted mode DEFAULT for MODEM_HADMSTATUS6  */

/* Bit fields for MODEM SRC2NCOCTRL */
#define _MODEM_SRC2NCOCTRL_RESETVALUE                           0x00000000UL                                  /**< Default value for MODEM_SRC2NCOCTRL         */
#define _MODEM_SRC2NCOCTRL_MASK                                 0x00007FFFUL                                  /**< Mask for MODEM_SRC2NCOCTRL                  */
#define MODEM_SRC2NCOCTRL_SRC2NCOEN                             (0x1UL << 0)                                  /**< Enable SRC2 NCO supplemental clock          */
#define _MODEM_SRC2NCOCTRL_SRC2NCOEN_SHIFT                      0                                             /**< Shift value for MODEM_SRC2NCOEN             */
#define _MODEM_SRC2NCOCTRL_SRC2NCOEN_MASK                       0x1UL                                         /**< Bit mask for MODEM_SRC2NCOEN                */
#define _MODEM_SRC2NCOCTRL_SRC2NCOEN_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for MODEM_SRC2NCOCTRL          */
#define MODEM_SRC2NCOCTRL_SRC2NCOEN_DEFAULT                     (_MODEM_SRC2NCOCTRL_SRC2NCOEN_DEFAULT << 0)   /**< Shifted mode DEFAULT for MODEM_SRC2NCOCTRL  */
#define _MODEM_SRC2NCOCTRL_PHASEPERCLK_SHIFT                    1                                             /**< Shift value for MODEM_PHASEPERCLK           */
#define _MODEM_SRC2NCOCTRL_PHASEPERCLK_MASK                     0x7FFEUL                                      /**< Bit mask for MODEM_PHASEPERCLK              */
#define _MODEM_SRC2NCOCTRL_PHASEPERCLK_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for MODEM_SRC2NCOCTRL          */
#define MODEM_SRC2NCOCTRL_PHASEPERCLK_DEFAULT                   (_MODEM_SRC2NCOCTRL_PHASEPERCLK_DEFAULT << 1) /**< Shifted mode DEFAULT for MODEM_SRC2NCOCTRL  */

/* Bit fields for MODEM SPARE */
#define _MODEM_SPARE_RESETVALUE                                 0x00000000UL                      /**< Default value for MODEM_SPARE               */
#define _MODEM_SPARE_MASK                                       0x000000FFUL                      /**< Mask for MODEM_SPARE                        */
#define _MODEM_SPARE_SPARE_SHIFT                                0                                 /**< Shift value for MODEM_SPARE                 */
#define _MODEM_SPARE_SPARE_MASK                                 0xFFUL                            /**< Bit mask for MODEM_SPARE                    */
#define _MODEM_SPARE_SPARE_DEFAULT                              0x00000000UL                      /**< Mode DEFAULT for MODEM_SPARE                */
#define MODEM_SPARE_SPARE_DEFAULT                               (_MODEM_SPARE_SPARE_DEFAULT << 0) /**< Shifted mode DEFAULT for MODEM_SPARE        */

/** @} End of group MGM24_MODEM_BitFields */
/** @} End of group MGM24_MODEM */
/** @} End of group Parts */

#endif /* MGM24_MODEM_H */
